hcitool.org
#+INCLUDE: ./main.setup
#+TITLE: hcitool
#+AUTHOR: Dongsoo Lee
#+EMAIL: dongsoolee8@gmail.com
#+DATE: 2018-02-20

* Overview
  :PROPERTIES: 
  :CUSTOM_ID: overview
  :LANG: en
  :END:      

Configure Bluetooth connections

** Introduction
  :PROPERTIES: 
  :CUSTOM_ID: introduction
  :LANG: en
  :END:    

hcitool is used to configure Bluetooth connections and send some special command to Bluetooth devices.
If no command is given, or if the option -h is used, hcitool prints some usage information and exits.

# * How to Install
#   :PROPERTIES: 
#   :CUSTOM_ID: how-to-install
#   :LANG_EN:  How to Install
#   :LANG_ES:  Cómo instalar
#   :LANG_KO:  설치 방법
#   :LANG_ZH:  如何安装
#   :LANG_JA:  インストール方法
#   :END:      

# ** Prerequisites
#    :PROPERTIES: 
#    :CUSTOM_ID: prerequisites
#    :LANG_EN:  Prerequisites
#    :LANG_ES:  Requisitos previos
#    :LANG_KO:  필요 사항
#    :LANG_ZH:  先决条件
#    :LANG_JA:  前準備
#    :END:      

# ** Install
#   :PROPERTIES: 
#   :CUSTOM_ID: install
#   :LANG_EN:  Install
#   :LANG_ES:  Instalar
#   :LANG_KO:  설치
#   :LANG_ZH:  安装
#   :LANG_JA:  インストール
#   :END:      

# ** Installed Packages
#    :PROPERTIES: 
#    :CUSTOM_ID: packages
#    :LANG_EN:  Installed Packages
#    :LANG_ES:  Paquetes instalados
#    :LANG_KO:  설치된 패키지
#    :LANG_ZH:  安装的软件包
#    :LANG_JA:  インストールされたパッケージ
#    :END:      

# ** Check
#    :PROPERTIES: 
#    :CUSTOM_ID: check
#    :LANG_EN:  Check
#    :LANG_ES:  Comprobar
#    :LANG_KO:  확인
#    :LANG_ZH:  检查
#    :LANG_JA:  チェック
#    :END:      

* Usage
  :PROPERTIES: 
  :CUSTOM_ID: usage
  :LANG: en
  :END:      

** Syntax
   :PROPERTIES: 
   :CUSTOM_ID: syntax
   :LANG: en
   :END:      

#+BEGIN_SRC sh
hcitool [-h]
hcitool [-i <hciX>] [command [command parameters]]
#+END_SRC

# ** Configuration
#    :PROPERTIES: 
#    :CUSTOM_ID: configuration
#    :LANG_EN:  Configuration
#    :LANG_ES:  Configuración
#    :LANG_KO:  설정
#    :LANG_ZH:  组态
#    :LANG_JA:  設定
#    :END:      

** Options
   :PROPERTIES: 
   :CUSTOM_ID: options
   :LANG: en
   :END:      

- {{{option(-h)}}} :
- {{{option(-i)}}} {{{argument(<hciX>)}}} :

** Commands
   :PROPERTIES: 
   :CUSTOM_ID: commands
   :LANG: en
   :END:      

*** dev
Display local devices
*** inq
Inquire remote devices. For each discovered device, Bluetooth device address, clock offset and class are printed.
*** scan
Inquire remote devices. For each discovered device, device name are printed.
*** name <bdaddr>

**** Syntax
   	 :PROPERTIES: 
   	 :CUSTOM_ID: syntax
   	 :LANG: en
   	 :END:      

#+BEGIN_SRC sh
name <bdaddr>
#+END_SRC


Print device name of remote device with Bluetooth address bdaddr.
*** info <bdaddr>
**** Syntax
   	 :PROPERTIES: 
   	 :CUSTOM_ID: syntax
   	 :LANG: en
   	 :END:      

#+BEGIN_SRC sh
info <bdaddr>
#+END_SRC

 Print device name, version and supported features of remote device with Bluetooth address bdaddr.
*** spinq 

Start periodic inquiry process. No inquiry results are printed.
*** epinq
Exit periodic inquiry process.
*** cmd
**** Syntax
   	 :PROPERTIES: 
   	 :CUSTOM_ID: syntax
   	 :LANG: en
   	 :END:      

#+BEGIN_SRC sh
cmd <ogf> <ocf> [parameters]
#+END_SRC

 Submit an arbitrary HCI command to local device. ogf, ocf and parameters are hexadecimal bytes.
*** con
Display active baseband connections
*** cc
**** Syntax
   	 :PROPERTIES: 
   	 :CUSTOM_ID: syntax
   	 :LANG: en
   	 :END:      

#+BEGIN_SRC sh
cc [--role=m|s] [--pkt-type=<ptype>] <bdaddr>
#+END_SRC

 Create baseband connection to remote device with Bluetooth address bdaddr. Option --pkt-type specifies a list of allowed packet types. <ptype> is a comma-sepa‐
 rated list of packet types, where the possible packet types are DM1, DM3, DM5, DH1, DH3, DH5, HV1, HV2, HV3. Default is to allow all packet types. Option --role
 can have value m (do not allow role switch, stay master) or s (allow role switch, become slave if the peer asks to become master). Default is m.
*** dc
