en/hcitool.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-03-01 Thu 01:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>hcitool</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dongsoo Lee" />
<meta name="google-site-verification" content="T-NdGYU-tk3BMWg0ULx4wIHD18IFoyrzEEcOoyz4xis" />
<link rel="stylesheet" type="text/css" href="/dist/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/dist/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="/dist/readtheorg/css/rtd-full.css"/>
<link rel="stylesheet" type="text/css" href="/dist/readtheorg/css/emphasis.css"/>
<link rel="stylesheet" type="text/css" href="/dist/assets/css.css"/>
<link href="https://maxcdn.bootstrapcdn.com/font-awesome/4.7.0/css/font-awesome.min.css" rel="stylesheet" integrity="sha384-wvfXpqpZZVQGK6TAh5PVlGOfQNHSoD2xbE+QkPxCAFlNEevoEH3Sl0sibVcOQVnN" crossorigin="anonymous">
<meta name="title" content="hcitool - Linux Commands">
<meta name="description" content="hcitool is used to configure Bluetooth connections and send some special command to Bluetooth devices. If no command is given, or if the option -h is used, hcitool prints some usage information and exits. Configure Bluetooth connections ">
<meta name="by" content="Dongsoo Lee">
<meta property="og:type" content="article">
<meta property="og:title" content="hcitool - Linux Commands">
<meta property="og:description" content="hcitool is used to configure Bluetooth connections and send some special command to Bluetooth devices. If no command is given, or if the option -h is used, hcitool prints some usage information and exits. Configure Bluetooth connections ">
<meta name="twitter:title" content="hcitool - Linux Commands">
<meta name="twitter:description" content="hcitool is used to configure Bluetooth connections and send some special command to Bluetooth devices. If no command is given, or if the option -h is used, hcitool prints some usage information and exits. Configure Bluetooth connections ">
<link rel="alternate" href="http://linux-command.org/en/hcitool.html" hreflang="en" />
<link rel="alternate" href="http://linux-command.org/es/hcitool.html" hreflang="es" />
<link rel="alternate" href="http://linux-command.org/ja/hcitool.html" hreflang="ja" />
<link rel="alternate" href="http://linux-command.org/ko/hcitool.html" hreflang="ko" />
<link rel="alternate" href="http://linux-command.org/zh/hcitool.html" hreflang="zh" />
</head>
<body>
<div id="content">
<h1 class="title">hcitool</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#overview">Overview</a>
<ul>
<li><a href="#introduction">Introduction</a></li>
</ul>
</li>
<li><a href="#usage">Usage</a>
<ul>
<li><a href="#syntax">Syntax</a></li>
<li><a href="#options">Options</a></li>
<li><a href="#commands">Commands</a>
<ul>
<li><a href="#org76bf254">dev</a></li>
<li><a href="#org1e66fea">inq</a></li>
<li><a href="#orga816e30">scan</a></li>
<li><a href="#orgf39b64c">name</a>
<ul>
<li><a href="#org0d42edd">Syntax</a></li>
</ul>
</li>
<li><a href="#orga309efc">info</a>
<ul>
<li><a href="#org7fbaf86">Syntax</a></li>
</ul>
</li>
<li><a href="#org9a22010">spinq</a></li>
<li><a href="#org25362a3">epinq</a></li>
<li><a href="#org16c0d02">cmd</a>
<ul>
<li><a href="#orgc4793eb">Syntax</a></li>
</ul>
</li>
<li><a href="#org7130bbc">con</a></li>
<li><a href="#orgcccf0b7">cc</a>
<ul>
<li><a href="#orga9d3b6f">Syntax</a></li>
</ul>
</li>
<li><a href="#orgdad6e11">dc</a>
<ul>
<li><a href="#orgecad4cf">Syntax</a></li>
</ul>
</li>
<li><a href="#orgf5c5cb8">sr</a>
<ul>
<li><a href="#org5e99615">Syntax</a></li>
</ul>
</li>
<li><a href="#orgf4495af">cpt</a>
<ul>
<li><a href="#org7a38f0c">Syntax</a></li>
</ul>
</li>
<li><a href="#org7f22a18">rssi</a>
<ul>
<li><a href="#orgecb6197">Syntax</a></li>
</ul>
</li>
<li><a href="#org7b9c92c">lq</a>
<ul>
<li><a href="#org681928c">Syntax</a></li>
</ul>
</li>
<li><a href="#org46e1fc8">tpl</a>
<ul>
<li><a href="#org7808e85">Syntax</a></li>
</ul>
</li>
<li><a href="#org157889c">afh</a>
<ul>
<li><a href="#orgc2973eb">Syntax</a></li>
</ul>
</li>
<li><a href="#orgd17e8df">lp</a>
<ul>
<li><a href="#orge82c6fb">Syntax</a></li>
</ul>
</li>
<li><a href="#org07e7af7">lst</a>
<ul>
<li><a href="#org0d47971">Syntax</a></li>
</ul>
</li>
<li><a href="#org07ec5e9">auth</a>
<ul>
<li><a href="#orgb63c2fb">Syntax</a></li>
</ul>
</li>
<li><a href="#orgb299287">enc</a>
<ul>
<li><a href="#orge127b41">Syntax</a></li>
</ul>
</li>
<li><a href="#org57a96bb">key</a>
<ul>
<li><a href="#orgbf3c191">Syntax</a></li>
</ul>
</li>
<li><a href="#org2aac019">clkoff</a>
<ul>
<li><a href="#org8f443e5">Syntax</a></li>
</ul>
</li>
<li><a href="#org5f1e5ea">clock</a>
<ul>
<li><a href="#org158f2cd">Syntax</a></li>
</ul>
</li>
<li><a href="#org15e3d9a">lescan</a>
<ul>
<li><a href="#org6aaf434">Syntax</a></li>
</ul>
</li>
<li><a href="#org8e565e3">leinfo</a>
<ul>
<li><a href="#org91206d8">Syntax</a></li>
</ul>
</li>
<li><a href="#orgd51e256">lewladd</a>
<ul>
<li><a href="#orgd847d7b">Syntax</a></li>
</ul>
</li>
<li><a href="#org8a7cc3d">lewlrm</a>
<ul>
<li><a href="#org17cf6c5">Syntax</a></li>
</ul>
</li>
<li><a href="#org65a7e82">lewlsz</a></li>
<li><a href="#org0c361fd">lewlclr</a></li>
<li><a href="#org68c5920">lerladd</a>
<ul>
<li><a href="#org0c5b731">Syntax</a></li>
</ul>
</li>
<li><a href="#org31adeb3">lerlrm</a>
<ul>
<li><a href="#orgc08f34b">Syntax</a></li>
</ul>
</li>
<li><a href="#org4f6aee9">lerlclr</a></li>
<li><a href="#org7904299">lerlsz</a></li>
<li><a href="#org7191d94">lerlon</a></li>
<li><a href="#orgf2d9c5b">lerloff</a></li>
<li><a href="#orga5ba214">lecc</a>
<ul>
<li><a href="#org7e32d06">Syntax</a></li>
</ul>
</li>
<li><a href="#org8b814fc">ledc</a>
<ul>
<li><a href="#orgbdd2211">Syntax</a></li>
</ul>
</li>
<li><a href="#org4f6465b">lecup</a>
<ul>
<li><a href="#org57c2f31">Syntax</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1866c74" class="outline-2">
<h2 id="overview"><a id="org1866c74"></a>Overview</h2>
<div class="outline-text-2" id="text-overview">
<p>
Configure Bluetooth connections
</p>
</div>

<div id="outline-container-orgc0a2c17" class="outline-3">
<h3 id="introduction"><a id="orgc0a2c17"></a>Introduction</h3>
<div class="outline-text-3" id="text-introduction">
<p>
hcitool is used to configure Bluetooth connections and send some special command to Bluetooth devices.
If no command is given, or if the option -h is used, hcitool prints some usage information and exits.
</p>
</div>
</div>
</div>

<div id="outline-container-org5ba6fdf" class="outline-2">
<h2 id="usage"><a id="org5ba6fdf"></a>Usage</h2>
<div class="outline-text-2" id="text-usage">
</div>

<div id="outline-container-org40121e8" class="outline-3">
<h3 id="syntax"><a id="org40121e8"></a>Syntax</h3>
<div class="outline-text-3" id="text-syntax">
<div class="org-src-container">
<pre class="src src-sh">hcitool [-h]
hcitool [-i &lt;hciX&gt;] [command [command parameters]]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb1a2623" class="outline-3">
<h3 id="options"><a id="orgb1a2623"></a>Options</h3>
<div class="outline-text-3" id="text-options">
<ul class="org-ul">
<li><span class="org-programming-option">-h</span> :</li>
<li><span class="org-programming-option">-i</span> <span class="org-programming-argument"><hciX></span> :</li>
</ul>
</div>
</div>

<div id="outline-container-orgc2d2fa9" class="outline-3">
<h3 id="commands"><a id="orgc2d2fa9"></a>Commands</h3>
<div class="outline-text-3" id="text-commands">
</div>

<div id="outline-container-org76bf254" class="outline-4">
<h4 id="org76bf254">dev</h4>
<div class="outline-text-4" id="text-org76bf254">
<p>
Display local devices
</p>
</div>
</div>
<div id="outline-container-org1e66fea" class="outline-4">
<h4 id="org1e66fea">inq</h4>
<div class="outline-text-4" id="text-org1e66fea">
<p>
Inquire remote devices. For each discovered device, Bluetooth device address, clock offset and class are printed.
</p>
</div>
</div>
<div id="outline-container-orga816e30" class="outline-4">
<h4 id="orga816e30">scan</h4>
<div class="outline-text-4" id="text-orga816e30">
<p>
Inquire remote devices. For each discovered device, device name are printed.
</p>
</div>
</div>
<div id="outline-container-orgf39b64c" class="outline-4">
<h4 id="orgf39b64c">name</h4>
<div class="outline-text-4" id="text-orgf39b64c">
</div>
<div id="outline-container-org0d42edd" class="outline-5">
<h5 id="org0d42edd">Syntax</h5>
<div class="outline-text-5" id="text-org0d42edd">
<div class="org-src-container">
<pre class="src src-sh">name &lt;bdaddr&gt;
</pre>
</div>


<p>
Print device name of remote device with Bluetooth address bdaddr.
</p>
</div>
</div>
</div>
<div id="outline-container-orga309efc" class="outline-4">
<h4 id="orga309efc">info</h4>
<div class="outline-text-4" id="text-orga309efc">
</div>
<div id="outline-container-org7fbaf86" class="outline-5">
<h5 id="org7fbaf86">Syntax</h5>
<div class="outline-text-5" id="text-org7fbaf86">
<div class="org-src-container">
<pre class="src src-sh">info &lt;bdaddr&gt;
</pre>
</div>

<p>
Print device name, version and supported features of remote device with Bluetooth address bdaddr.
</p>
</div>
</div>
</div>
<div id="outline-container-org9a22010" class="outline-4">
<h4 id="org9a22010">spinq</h4>
<div class="outline-text-4" id="text-org9a22010">
<p>
Start periodic inquiry process. No inquiry results are printed.
</p>
</div>
</div>
<div id="outline-container-org25362a3" class="outline-4">
<h4 id="org25362a3">epinq</h4>
<div class="outline-text-4" id="text-org25362a3">
<p>
Exit periodic inquiry process.
</p>
</div>
</div>
<div id="outline-container-org16c0d02" class="outline-4">
<h4 id="org16c0d02">cmd</h4>
<div class="outline-text-4" id="text-org16c0d02">
</div>
<div id="outline-container-orgc4793eb" class="outline-5">
<h5 id="orgc4793eb">Syntax</h5>
<div class="outline-text-5" id="text-orgc4793eb">
<div class="org-src-container">
<pre class="src src-sh">cmd &lt;ogf&gt; &lt;ocf&gt; [parameters]
</pre>
</div>

<p>
Submit an arbitrary HCI command to local device. ogf, ocf and parameters are hexadecimal bytes.
</p>
</div>
</div>
</div>
<div id="outline-container-org7130bbc" class="outline-4">
<h4 id="org7130bbc">con</h4>
<div class="outline-text-4" id="text-org7130bbc">
<p>
Display active baseband connections
</p>
</div>
</div>
<div id="outline-container-orgcccf0b7" class="outline-4">
<h4 id="orgcccf0b7">cc</h4>
<div class="outline-text-4" id="text-orgcccf0b7">
</div>
<div id="outline-container-orga9d3b6f" class="outline-5">
<h5 id="orga9d3b6f">Syntax</h5>
<div class="outline-text-5" id="text-orga9d3b6f">
<div class="org-src-container">
<pre class="src src-sh">cc [--role=m|s] [--pkt-type=&lt;ptype&gt;] &lt;bdaddr&gt;
</pre>
</div>

<p>
Create baseband connection to remote device with Bluetooth address bdaddr. Option --pkt-type specifies a list of allowed packet types. &lt;ptype&gt; is a comma-sepa‐
rated list of packet types, where the possible packet types are DM1, DM3, DM5, DH1, DH3, DH5, HV1, HV2, HV3. Default is to allow all packet types. Option --role
can have value m (do not allow role switch, stay master) or s (allow role switch, become slave if the peer asks to become master). Default is m.
</p>
</div>
</div>
</div>
