hcitool.org
**** Syntax
   	 :PROPERTIES: 
   	 :CUSTOM_ID: syntax
   	 :LANG: en
   	 :END:      

#+BEGIN_SRC sh
dc <bdaddr> [reason]
#+END_SRC

 Delete baseband connection from remote device with Bluetooth address bdaddr. The reason can be one of the Bluetooth HCI error codes. Default is 19 for user ended
 connections. The value must be given in decimal.
*** sr
**** Syntax
   	 :PROPERTIES: 
   	 :CUSTOM_ID: syntax
   	 :LANG: en
   	 :END:      

#+BEGIN_SRC sh
sr <bdaddr> <role>
#+END_SRC

 Switch role for the baseband connection from the remote device to master or slave.
*** cpt
**** Syntax
   	 :PROPERTIES: 
   	 :CUSTOM_ID: syntax
   	 :LANG: en
   	 :END:      

#+BEGIN_SRC sh
cpt <bdaddr> <packet types>
#+END_SRC

 Change packet types for baseband connection to device with Bluetooth address bdaddr. packet types is a comma-separated list of packet types, where the possible
 packet types are DM1, DM3, DM5, DH1, DH3, DH5, HV1, HV2, HV3.
*** rssi
**** Syntax
   	 :PROPERTIES: 
   	 :CUSTOM_ID: syntax
   	 :LANG: en
   	 :END:      

#+BEGIN_SRC sh
rssi <bdaddr>
#+END_SRC

 Display received signal strength information for the connection to the device with Bluetooth address bdaddr.
*** lq
**** Syntax
   	 :PROPERTIES: 
   	 :CUSTOM_ID: syntax
   	 :LANG: en
   	 :END:      

#+BEGIN_SRC sh
lq <bdaddr>
#+END_SRC

 Display link quality for the connection to the device with Bluetooth address bdaddr.
*** tpl
**** Syntax
   	 :PROPERTIES: 
   	 :CUSTOM_ID: syntax
   	 :LANG: en
   	 :END:      

#+BEGIN_SRC sh
tpl <bdaddr> [type]
#+END_SRC

 Display transmit power level for the connection to the device with Bluetooth address bdaddr. The type can be 0 for the current transmit power level (which is
 default) or 1 for the maximum transmit power level.
*** afh
**** Syntax
   	 :PROPERTIES: 
   	 :CUSTOM_ID: syntax
   	 :LANG: en
   	 :END:      

#+BEGIN_SRC sh
afh <bdaddr>
#+END_SRC

 Display AFH channel map for the connection to the device with Bluetooth address bdaddr.
*** lp
**** Syntax
   	 :PROPERTIES: 
   	 :CUSTOM_ID: syntax
   	 :LANG: en
   	 :END:      

#+BEGIN_SRC sh
lp <bdaddr> [value]
#+END_SRC

 With no value, displays link policy settings for the connection to the device with Bluetooth address bdaddr. If value is given, sets the link policy settings for
 that connection to value. Possible values are RSWITCH, HOLD, SNIFF and PARK.
*** lst
**** Syntax
   	 :PROPERTIES: 
   	 :CUSTOM_ID: syntax
   	 :LANG: en
   	 :END:      

#+BEGIN_SRC sh
lst <bdaddr> [value]
#+END_SRC

 With no value, displays link supervision timeout for the connection to the device with Bluetooth address bdaddr. If value is given, sets the link supervision
 timeout for that connection to value slots, or to infinite if value is 0.
*** auth
**** Syntax
   	 :PROPERTIES: 
   	 :CUSTOM_ID: syntax
   	 :LANG: en
   	 :END:      

#+BEGIN_SRC sh
auth <bdaddr>
#+END_SRC

 Request authentication for the device with Bluetooth address bdaddr.
*** enc
**** Syntax
   	 :PROPERTIES: 
   	 :CUSTOM_ID: syntax
   	 :LANG: en
   	 :END:      

#+BEGIN_SRC sh
enc <bdaddr> [encrypt enable]
#+END_SRC

 Enable or disable the encryption for the device with Bluetooth address bdaddr.
*** key
**** Syntax
   	 :PROPERTIES: 
   	 :CUSTOM_ID: syntax
   	 :LANG: en
   	 :END:      

#+BEGIN_SRC sh
key <bdaddr>
#+END_SRC

 Change the connection link key for the device with Bluetooth address bdaddr.
*** clkoff
**** Syntax
   	 :PROPERTIES: 
   	 :CUSTOM_ID: syntax
   	 :LANG: en
   	 :END:      

#+BEGIN_SRC sh
clkoff <bdaddr>
#+END_SRC

 Read the clock offset for the device with Bluetooth address bdaddr.
*** clock
**** Syntax
   	 :PROPERTIES: 
   	 :CUSTOM_ID: syntax
   	 :LANG: en
   	 :END:      

#+BEGIN_SRC sh
clock [bdaddr] [which clock]
#+END_SRC

 Read the clock for the device with Bluetooth address bdaddr. The clock can be 0 for the local clock or 1 for the piconet clock (which is default).
*** lescan
**** Syntax
   	 :PROPERTIES: 
   	 :CUSTOM_ID: syntax
   	 :LANG: en
   	 :END:      

#+BEGIN_SRC sh
lescan [--privacy] [--passive] [--whitelist] [--discovery=g|l] [--duplicates]
#+END_SRC

 Start LE scan
*** leinfo
**** Syntax
   	 :PROPERTIES: 
   	 :CUSTOM_ID: syntax
   	 :LANG: en
   	 :END:      

#+BEGIN_SRC sh
leinfo [--static] [--random] <bdaddr>
#+END_SRC

 Get LE remote information
*** lewladd
**** Syntax
   	 :PROPERTIES: 
   	 :CUSTOM_ID: syntax
   	 :LANG: en
   	 :END:      

#+BEGIN_SRC sh
lewladd [--random] <bdaddr>
#+END_SRC

 Add device to LE White List
*** lewlrm
**** Syntax
   	 :PROPERTIES: 
   	 :CUSTOM_ID: syntax
   	 :LANG: en
   	 :END:      

#+BEGIN_SRC sh
lewlrm <bdaddr>
#+END_SRC

 Remove device from LE White List
*** lewlsz
Read size of LE White List
*** lewlclr
 Clear LE White List
*** lerladd
**** Syntax
   	 :PROPERTIES: 
   	 :CUSTOM_ID: syntax
   	 :LANG: en
   	 :END:      

#+BEGIN_SRC sh
lerladd [--local irk] [--peer irk] [--random] <bdaddr>
#+END_SRC

 Add device to LE Resolving List
*** lerlrm
**** Syntax
   	 :PROPERTIES: 
   	 :CUSTOM_ID: syntax
   	 :LANG: en
   	 :END:      

#+BEGIN_SRC sh
lerlrm <bdaddr>
#+END_SRC

 Remove device from LE Resolving List
