en/hcitool.html
<div id="outline-container-orgdad6e11" class="outline-4">
<h4 id="orgdad6e11">dc</h4>
<div class="outline-text-4" id="text-orgdad6e11">
</div>
<div id="outline-container-orgecad4cf" class="outline-5">
<h5 id="orgecad4cf">Syntax</h5>
<div class="outline-text-5" id="text-orgecad4cf">
<div class="org-src-container">
<pre class="src src-sh">dc &lt;bdaddr&gt; [reason]
</pre>
</div>

<p>
Delete baseband connection from remote device with Bluetooth address bdaddr. The reason can be one of the Bluetooth HCI error codes. Default is 19 for user ended
connections. The value must be given in decimal.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf5c5cb8" class="outline-4">
<h4 id="orgf5c5cb8">sr</h4>
<div class="outline-text-4" id="text-orgf5c5cb8">
</div>
<div id="outline-container-org5e99615" class="outline-5">
<h5 id="org5e99615">Syntax</h5>
<div class="outline-text-5" id="text-org5e99615">
<div class="org-src-container">
<pre class="src src-sh">sr &lt;bdaddr&gt; &lt;role&gt;
</pre>
</div>

<p>
Switch role for the baseband connection from the remote device to master or slave.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf4495af" class="outline-4">
<h4 id="orgf4495af">cpt</h4>
<div class="outline-text-4" id="text-orgf4495af">
</div>
<div id="outline-container-org7a38f0c" class="outline-5">
<h5 id="org7a38f0c">Syntax</h5>
<div class="outline-text-5" id="text-org7a38f0c">
<div class="org-src-container">
<pre class="src src-sh">cpt &lt;bdaddr&gt; &lt;packet types&gt;
</pre>
</div>

<p>
Change packet types for baseband connection to device with Bluetooth address bdaddr. packet types is a comma-separated list of packet types, where the possible
packet types are DM1, DM3, DM5, DH1, DH3, DH5, HV1, HV2, HV3.
</p>
</div>
</div>
</div>
<div id="outline-container-org7f22a18" class="outline-4">
<h4 id="org7f22a18">rssi</h4>
<div class="outline-text-4" id="text-org7f22a18">
</div>
<div id="outline-container-orgecb6197" class="outline-5">
<h5 id="orgecb6197">Syntax</h5>
<div class="outline-text-5" id="text-orgecb6197">
<div class="org-src-container">
<pre class="src src-sh">rssi &lt;bdaddr&gt;
</pre>
</div>

<p>
Display received signal strength information for the connection to the device with Bluetooth address bdaddr.
</p>
</div>
</div>
</div>
<div id="outline-container-org7b9c92c" class="outline-4">
<h4 id="org7b9c92c">lq</h4>
<div class="outline-text-4" id="text-org7b9c92c">
</div>
<div id="outline-container-org681928c" class="outline-5">
<h5 id="org681928c">Syntax</h5>
<div class="outline-text-5" id="text-org681928c">
<div class="org-src-container">
<pre class="src src-sh">lq &lt;bdaddr&gt;
</pre>
</div>

<p>
Display link quality for the connection to the device with Bluetooth address bdaddr.
</p>
</div>
</div>
</div>
<div id="outline-container-org46e1fc8" class="outline-4">
<h4 id="org46e1fc8">tpl</h4>
<div class="outline-text-4" id="text-org46e1fc8">
</div>
<div id="outline-container-org7808e85" class="outline-5">
<h5 id="org7808e85">Syntax</h5>
<div class="outline-text-5" id="text-org7808e85">
<div class="org-src-container">
<pre class="src src-sh">tpl &lt;bdaddr&gt; [type]
</pre>
</div>

<p>
Display transmit power level for the connection to the device with Bluetooth address bdaddr. The type can be 0 for the current transmit power level (which is
default) or 1 for the maximum transmit power level.
</p>
</div>
</div>
</div>
<div id="outline-container-org157889c" class="outline-4">
<h4 id="org157889c">afh</h4>
<div class="outline-text-4" id="text-org157889c">
</div>
<div id="outline-container-orgc2973eb" class="outline-5">
<h5 id="orgc2973eb">Syntax</h5>
<div class="outline-text-5" id="text-orgc2973eb">
<div class="org-src-container">
<pre class="src src-sh">afh &lt;bdaddr&gt;
</pre>
</div>

<p>
Display AFH channel map for the connection to the device with Bluetooth address bdaddr.
</p>
</div>
</div>
</div>
<div id="outline-container-orgd17e8df" class="outline-4">
<h4 id="orgd17e8df">lp</h4>
<div class="outline-text-4" id="text-orgd17e8df">
</div>
<div id="outline-container-orge82c6fb" class="outline-5">
<h5 id="orge82c6fb">Syntax</h5>
<div class="outline-text-5" id="text-orge82c6fb">
<div class="org-src-container">
<pre class="src src-sh">lp &lt;bdaddr&gt; [value]
</pre>
</div>

<p>
With no value, displays link policy settings for the connection to the device with Bluetooth address bdaddr. If value is given, sets the link policy settings for
that connection to value. Possible values are RSWITCH, HOLD, SNIFF and PARK.
</p>
</div>
</div>
</div>
<div id="outline-container-org07e7af7" class="outline-4">
<h4 id="org07e7af7">lst</h4>
<div class="outline-text-4" id="text-org07e7af7">
</div>
<div id="outline-container-org0d47971" class="outline-5">
<h5 id="org0d47971">Syntax</h5>
<div class="outline-text-5" id="text-org0d47971">
<div class="org-src-container">
<pre class="src src-sh">lst &lt;bdaddr&gt; [value]
</pre>
</div>

<p>
With no value, displays link supervision timeout for the connection to the device with Bluetooth address bdaddr. If value is given, sets the link supervision
timeout for that connection to value slots, or to infinite if value is 0.
</p>
</div>
</div>
</div>
<div id="outline-container-org07ec5e9" class="outline-4">
<h4 id="org07ec5e9">auth</h4>
<div class="outline-text-4" id="text-org07ec5e9">
</div>
<div id="outline-container-orgb63c2fb" class="outline-5">
<h5 id="orgb63c2fb">Syntax</h5>
<div class="outline-text-5" id="text-orgb63c2fb">
<div class="org-src-container">
<pre class="src src-sh">auth &lt;bdaddr&gt;
</pre>
</div>

<p>
Request authentication for the device with Bluetooth address bdaddr.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb299287" class="outline-4">
<h4 id="orgb299287">enc</h4>
<div class="outline-text-4" id="text-orgb299287">
</div>
<div id="outline-container-orge127b41" class="outline-5">
<h5 id="orge127b41">Syntax</h5>
<div class="outline-text-5" id="text-orge127b41">
<div class="org-src-container">
<pre class="src src-sh">enc &lt;bdaddr&gt; [encrypt enable]
</pre>
</div>

<p>
Enable or disable the encryption for the device with Bluetooth address bdaddr.
</p>
</div>
</div>
</div>
<div id="outline-container-org57a96bb" class="outline-4">
<h4 id="org57a96bb">key</h4>
<div class="outline-text-4" id="text-org57a96bb">
</div>
<div id="outline-container-orgbf3c191" class="outline-5">
<h5 id="orgbf3c191">Syntax</h5>
<div class="outline-text-5" id="text-orgbf3c191">
<div class="org-src-container">
<pre class="src src-sh">key &lt;bdaddr&gt;
</pre>
</div>

<p>
Change the connection link key for the device with Bluetooth address bdaddr.
</p>
</div>
</div>
</div>
<div id="outline-container-org2aac019" class="outline-4">
<h4 id="org2aac019">clkoff</h4>
<div class="outline-text-4" id="text-org2aac019">
</div>
<div id="outline-container-org8f443e5" class="outline-5">
<h5 id="org8f443e5">Syntax</h5>
<div class="outline-text-5" id="text-org8f443e5">
<div class="org-src-container">
<pre class="src src-sh">clkoff &lt;bdaddr&gt;
</pre>
</div>

<p>
Read the clock offset for the device with Bluetooth address bdaddr.
</p>
</div>
</div>
</div>
<div id="outline-container-org5f1e5ea" class="outline-4">
<h4 id="org5f1e5ea">clock</h4>
<div class="outline-text-4" id="text-org5f1e5ea">
</div>
<div id="outline-container-org158f2cd" class="outline-5">
<h5 id="org158f2cd">Syntax</h5>
<div class="outline-text-5" id="text-org158f2cd">
<div class="org-src-container">
<pre class="src src-sh">clock [bdaddr] [which clock]
</pre>
</div>

<p>
Read the clock for the device with Bluetooth address bdaddr. The clock can be 0 for the local clock or 1 for the piconet clock (which is default).
</p>
</div>
</div>
</div>
<div id="outline-container-org15e3d9a" class="outline-4">
<h4 id="org15e3d9a">lescan</h4>
<div class="outline-text-4" id="text-org15e3d9a">
</div>
<div id="outline-container-org6aaf434" class="outline-5">
<h5 id="org6aaf434">Syntax</h5>
<div class="outline-text-5" id="text-org6aaf434">
<div class="org-src-container">
<pre class="src src-sh">lescan [--privacy] [--passive] [--whitelist] [--discovery=g|l] [--duplicates]
</pre>
</div>

<p>
Start LE scan
</p>
</div>
</div>
</div>
<div id="outline-container-org8e565e3" class="outline-4">
<h4 id="org8e565e3">leinfo</h4>
<div class="outline-text-4" id="text-org8e565e3">
</div>
<div id="outline-container-org91206d8" class="outline-5">
<h5 id="org91206d8">Syntax</h5>
<div class="outline-text-5" id="text-org91206d8">
<div class="org-src-container">
<pre class="src src-sh">leinfo [--static] [--random] &lt;bdaddr&gt;
</pre>
</div>

<p>
Get LE remote information
</p>
</div>
</div>
</div>
<div id="outline-container-orgd51e256" class="outline-4">
<h4 id="orgd51e256">lewladd</h4>
<div class="outline-text-4" id="text-orgd51e256">
</div>
<div id="outline-container-orgd847d7b" class="outline-5">
<h5 id="orgd847d7b">Syntax</h5>
<div class="outline-text-5" id="text-orgd847d7b">
<div class="org-src-container">
<pre class="src src-sh">lewladd [--random] &lt;bdaddr&gt;
</pre>
</div>

<p>
Add device to LE White List
</p>
</div>
</div>
</div>
<div id="outline-container-org8a7cc3d" class="outline-4">
<h4 id="org8a7cc3d">lewlrm</h4>
<div class="outline-text-4" id="text-org8a7cc3d">
</div>
<div id="outline-container-org17cf6c5" class="outline-5">
<h5 id="org17cf6c5">Syntax</h5>
<div class="outline-text-5" id="text-org17cf6c5">
<div class="org-src-container">
<pre class="src src-sh">lewlrm &lt;bdaddr&gt;
</pre>
</div>

<p>
Remove device from LE White List
</p>
</div>
</div>
</div>
<div id="outline-container-org65a7e82" class="outline-4">
<h4 id="org65a7e82">lewlsz</h4>
<div class="outline-text-4" id="text-org65a7e82">
<p>
Read size of LE White List
</p>
</div>
</div>
<div id="outline-container-org0c361fd" class="outline-4">
<h4 id="org0c361fd">lewlclr</h4>
<div class="outline-text-4" id="text-org0c361fd">
<p>
Clear LE White List
</p>
</div>
</div>
<div id="outline-container-org68c5920" class="outline-4">
<h4 id="org68c5920">lerladd</h4>
<div class="outline-text-4" id="text-org68c5920">
</div>
<div id="outline-container-org0c5b731" class="outline-5">
<h5 id="org0c5b731">Syntax</h5>
<div class="outline-text-5" id="text-org0c5b731">
<div class="org-src-container">
<pre class="src src-sh">lerladd [--local irk] [--peer irk] [--random] &lt;bdaddr&gt;
</pre>
</div>

<p>
Add device to LE Resolving List
</p>
</div>
</div>
</div>
